Revit 2027 API
BuiltInFailures.EditingFailures.CannotDeletePredefinedFamilyElement Property
 Element is a built-in part of the family definition and cannot be deleted or added to groups.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDeletePredefinedFamilyElement { get; }
Public Shared ReadOnly Property CannotDeletePredefinedFamilyElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDeletePredefinedFamilyElement {
	FailureDefinitionId^ get ();
}
static member CannotDeletePredefinedFamilyElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace